### **實作題 1:成績判斷與分級**
'''
撰寫一個程式,讓使用者輸入多個學生的成績。程式應判斷每個成績是否及格
(及格標準為 60 分),若及格且分數達 90 分以上,顯示「優秀」,否則顯示
「不及格」。最後程式要統計並輸出總共多少學生及格,多少學生不及格。
'''
# b=0
# c=0
# a=0
# while a != 9999:
#     a = int(input("請輸入分數:"))
#     if a >=90:
#         print("優秀")
#         b+=1
#     elif a>=60:
#         print("及格")
#         b+=1
#     else:
#         print("不及格")
#         c+=1
# print(f'及格人數:{b},不及格人數:{c}')

### **實作題 2:偶數與奇數的判斷**
'''
請撰寫一個程式,使用亂數產生 20 個數字,並判斷這些數字是奇數還是偶
數,最後統計並顯示奇數和偶數的數量。
'''
# import random
# b=0
# c=0
# for i in range(20):
#     a = random.randint(1,100)
#     if a % 2 == 0 :
#         print(f'{a}:偶數')
#         b+=1
#     else:
#         print(f'{a}:奇數')
#         c+=1
    
# print(f'偶數:{b},奇數:{c}')


### **實作題 3:字串處理 - 反轉字串**
'''
請撰寫一個函式,讓使用者輸入一段字串,程式會輸出該字串的反轉結果。
'''
# lista = []
# a = str(input("請輸入一串文字:"))
# for i in a[::-1]:
#     print(i,end="")

### **實作題 4:計算數字總和與平均**
'''
撰寫一個函式,讓使用者輸入一個數字範圍,計算範圍內所有整數的總和與平
均數,並將結果輸出。
'''
# def ax():
#     a = int(input("請輸入範圍起始值:"))
#     b = int(input("請輸入範圍結束值:"))
#     c=b-a#數量
#     for i in range(c+1):
#         a=a+i
#         print(a)
#     print(f'總和:{a},平均:{a/c}')
# ax()
### **實作題 5:串列元素運算與排序**
'''
撰寫一個程式,讓使用者輸入 5 個數字,將這些數字儲存到串列中,並計算它
們的總和與平均數。最後輸出已排序的串列與總和及平均數。
'''
# lista = []
# for i in range(5):
#     a = int(input("請輸入數字:"))
#     lista.append(a)
# b= sorted(lista)
# print(b)
# print(f'總數:{sum(lista)},平均數:{sum(lista)/len(lista)}')
